bit-finance/InformationRegisters/бит_НастройкиОбъектовВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиОбъектовВизирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьВизирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОбновленияВиз</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыОбновленияПеречняВиз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимКонтроляВложений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриниматьКУчетуПослеУтверждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_ВидыКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКонтролировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контролировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/InformationRegisters/бит_НастройкиОбъектовВизирования/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.РежимКонтроляВложений.Пустая() Тогда
		Запись.РежимКонтроляВложений = ПредопределенноеЗначение("Перечисление.бит_ВидыКонтроля.НеКонтролировать");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	Запись.ПриниматьКУчетуПослеУтверждения = Ложь;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	УправлениеРежимомКонтроляВложений();
	УправлениеПринятиемКУчету();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеРежимомКонтроляВложений()
	
	Элементы.РежимКонтроляВложений.Видимость = Истина;
	
	ОбъектСистемы = Запись.ОбъектСистемы;
	Если ОбъектСистемы.Пустая() Тогда
		Возврат;
	КонецЕсли;

	ИмяТипа    = ОбъектСистемы.ИмяОбъектаПолное;
	ИмяТипа    = СтрЗаменить(ИмяТипа, "Документ.", "ДокументОбъект.");
	ИмяТипа    = СтрЗаменить(ИмяТипа, "Справочник.", "СправочникОбъект.");
	ТипОбъекта = Тип(ИмяТипа);
	
	Если Метаданные.ОпределяемыеТипы.бит_ОбъектыКонтроляВложений.Тип.СодержитТип(ТипОбъекта)
		ИЛИ бит_ОбщегоНазначенияПереопределяемый.ИспользуетсяМеханизмПозиций(ТипОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	Запись.РежимКонтроляВложений = Перечисления.бит_ВидыКонтроля.НеКонтролировать;
	Элементы.РежимКонтроляВложений.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеПринятиемКУчету()
	
	Элементы.ПриниматьКУчетуПослеУтверждения.Видимость = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Запись.ОбъектСистемы) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыСистемы = бит_ВизированиеСервер.ОбъектыСистемыСДоступнымМеханизмомПринятияКУчету();
	Элементы.ПриниматьКУчетуПослеУтверждения.Видимость =
		(ОбъектыСистемы.НайтиПоЗначению(Запись.ОбъектСистемы) <> Неопределено);
	
КонецПроцедуры

#КонецОбласти
